OAT15_DDES_SA_z30/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 6.19016e-6;

boundaryField
{
    outerBoundary
    {
        type            calculated;
        value           $internalField;
    }

    airfoil
    {
        type            fixedValue;
        value           uniform 0;
    }

    Front
    {
        type            cyclic;
    }

    Back
    {
        type            cyclic;
    }
    
    processor
    {
        type  processor;
        value $internalField;
    }

    processorCyclic
    {
        type  processorCyclic;
        value $internalField;
    }
}

// ************************************************************************* //
