OAT15_DDES_SA_z30/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.063;

deltaT          5e-7;

writeControl    adjustable;

writeInterval   1e-3;

purgeWrite      0;

writeFormat     binary;

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.95;

maxDeltaT       1e-6;

functions
{
    pressure
    {
        type            pressure;
        libs            (fieldFunctionObjects);
        mode            totalCoeff;
        pInf            75230;
        rhoInf          0.957837;
       
        Uinlet          238.845;    // free stream velocity
        alpha           5.0;        // angle of attack

        Ux      #eval{$Uinlet * cos(degToRad($alpha))};
        Uz      #eval{$Uinlet * sin(degToRad($alpha))};

        UInf         ($Ux 0 $Uz);

        writeFields     false;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
    }

    forces
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;
        log             false;

        patches
        (
            airfoil
        );

        // taken from: https://develop.openfoam.com/Development/openfoam/-/blob/OpenFOAM-v2412/tutorials/incompressible/pimpleFoam/LES/NACA4412/system/forceCoeffs
        AoA             5.0;       // angle of attack

        liftDir         (
                            #eval{-sin(degToRad($AoA))} 
                            0 
                            #eval{cos(degToRad($AoA))}
                        );
        dragDir         (
                            #eval{cos(degToRad($AoA))} 
                            0 
                            #eval{sin(degToRad($AoA))}
                        );
        pitchAxis   (0 1 0);
        CofR        (0.25 0 0); // center of rotation at 25% chord
        rhoInf      0.957837;
        magUInf     238.845;
        lRef        0.15;
        Aref        0.004725;   // projected area of the airfoil
    }

    Mach
    {
        type            MachNo;
        libs            (fieldFunctionObjects);
        field           U;
        log             true;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
    }

    DESField
    {
        type            DESModelRegions;
        libs            (fieldFunctionObjects);
        result          DESField;
        log             true;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
    }

    wallShearStress
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        patches         (airfoil);
        log             true;
        executeControl  writeTime;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
    }

    surface
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        timeStart       3e-3;

        surfaceFormat   raw;
        fields          (total(p)_coeff yPlus p rho T wallShearStress);

        surfaces
        {
            airfoil
            {
                type            patch;
                patches         (airfoil);
                interpolate     true;
                invariant       true;
                surfaceFormat   raw;
            }
        }
    }

    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        log             true;
        writeFields     false;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
    }

    fieldAverage
    {
        type             fieldAverage;
        libs             (fieldFunctionObjects);
        executeControl   timeStep;
        executeInterval  1;
        writeControl     writeTime;
        writeInterval    1;
        timeStart        4e-3;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }

    // #include "FOResolutionIndex"
    // #include "FOmaskedResolutionIndex"

    turbulenceFields
    {
        type            turbulenceFields;
        libs            (fieldFunctionObjects);
        field           fd;

        enabled         true;
        writeControl    writeTime;
    }

    solverInfo
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        fields          (U p T);
        writeResidualFields no;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
    }
}

// ************************************************************************* //
